In [1]:
import pandas as pd

# DataFrame
- 2차원 배열
- 행과 열로 구성

In [2]:
# Dictionary를 이용한 DataFrame 생성
dict_data = {'c0':[1,2,3,], 'c1':[4,5,6], 'c2':[7,8,9], 'c3':[10,11,12], 'c4':[123,14,15]}
dict_data

{'c0': [1, 2, 3],
 'c1': [4, 5, 6],
 'c2': [7, 8, 9],
 'c3': [10, 11, 12],
 'c4': [123, 14, 15]}

In [4]:
df = pd.DataFrame(dict_data)  # Dictionary는 쌓이는 방향이 세로
df

   c0  c1  c2  c3   c4
0   1   4   7  10  123
1   2   5   8  11   14
2   3   6   9  12   15

In [7]:
# List를 이용한 DataFrame 생성 - 쌓이는 방향이 가로
df = pd.DataFrame(
    [[15, '남', '덕영중'],
    [17, '여', '수리중']],
    index=['준서', '예원'],
    columns=['나이','성별','학교']       
    )
df

    나이 성별   학교
준서  15  남  덕영중
예원  17  여  수리중

In [9]:
# 행과 열 이름 변경하기
print(df.index)
print(df.columns)

Index(['준서', '예원'], dtype='object')
Index(['나이', '성별', '학교'], dtype='object')

In [10]:
# 행 인덱스, 열 이름 변경하기 - 1
df.index = ['학생1', '학생2']
df.columns = ['연령', '남녀', '소속']
df

     연령 남녀   소속
학생1  15  남  덕영중
학생2  17  여  수리중

In [11]:
df = pd.DataFrame(
    [[15, '남', '덕영중'],
    [17, '여', '수리중']],
    index=['준서', '예원'],
    columns=['나이','성별','학교']       
    )
df

    나이 성별   학교
준서  15  남  덕영중
예원  17  여  수리중

In [14]:
df.rename(columns={'나이':'연령', '성별':'남여', '학교':'소속'}, inplace=True)  # inplace=True 바로 적용
df

    연령 남여   소속
준서  15  남  덕영중
예원  17  여  수리중

In [16]:
# 행 이름 변경하기
# df의 행 인덱스 중에서, '준서'를 '학생1'로 '예원'을 '학생2'로 바꾸기
df.rename(index={'준서':'학생1', '예원':'학생2'}, inplace=True)
df

     연령 남여   소속
학생1  15  남  덕영중
학생2  17  여  수리중

In [17]:
df = pd.DataFrame(
                [[90, 98, 85, 100],
                 [80, 89, 95, 90],
                 [70, 95, 100, 90]
                ], columns=['수학', '영어', '음악', '체육'],
                index= ['서준', '우현', '인아']
                )
df

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

### 행삭제

In [27]:
df2 = df.copy()

In [28]:
df2

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [31]:
# df2의 index가 우현인 1개행을 삭제
df2.drop('우현', axis=0, inplace = True) # axis=0은 기본값, 명시적으로 적어주는것이 좋다

In [32]:
df2

    수학  영어   음악   체육
서준  90  98   85  100
인아  70  95  100   90

In [34]:
df3 = df.copy()
df3

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [35]:
# df3의 index가 우현과 인아인 2개 행을 삭제
df3.drop(['우현','인아'], axis=0, inplace=True)
df3

    수학  영어  음악   체육
서준  90  98  85  100

In [36]:
# 열 삭제
df4 = df.copy()
df4

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [37]:
# df4의 수학 1개 역을 삭제
df4.drop('수학', axis=1, inplace=True)
df4

    영어   음악   체육
서준  98   85  100
우현  89   95   90
인아  95  100   90

In [42]:
df5 = df.copy()
df5

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [43]:
# df5의 영어와 음악 2개 열을 삭제 - 0:rows, 1:colums 로 대체하여 사용가능
df5.drop(['영어', '음악'], axis='columns', inplace=True)
df5

    수학   체육
서준  90  100
우현  80   90
인아  70   90